f = """
88880500 比赛即将开始！请做好准备！ 0
88880524 王牌竞赛 收割者 0
88880534 王牌竞赛 孤狼 0
88880542 来吧！再猛烈些吧！ 1
88880506 王牌竞赛 飞将 0
88880510 王牌竞赛 老兵 1
88880538 王牌竞赛 龙 2
88880526 王牌竞赛 武内 1
88880520 我！看到你了！ 0
88880508 王牌竞赛 镭射 1
88880502 伏击开始了！向前推进！ 1
88881100 灭龙剑士 阿耆尼马兹德·消灭 1
88881104 真龙剑凰 玛丽亚姆内 1
60001220 黄金之靴 0
60001221 战栗的海盗旗 1
60001212 空绝的崇拜者 1
60001225 海潮炮手 1
60001219 大洋斥候 1
"""
sl = f.split("\n")
rl = []
tl = []
for item in sl:
	rl.append(item.split(" "))
for item in rl:
	tl.append(item[0] + " " + item[-1] + " --" + " ".join(item[1:-1]))
for item in tl:
	if item.split(" ")[1] == "0":
		print(item)
for item in tl:
	if item.split(" ")[1] == "1":
		print(item)
for item in tl:
	if item.split(" ")[1] == "2":
		print(item)
