f = """
66060030 幻星集 命运之占卜 1
66060008 幻星集 力量 1
66060015 幻星集 恶魔 1
66060004 幻星集 皇帝 1
66060002 幻星集 女祭司 1
66060021 幻星集 审判 2
88881730 废墟兵械 剑龙 1
88881746 废墟兵械 风神翼龙 0
88881732 废墟兵械 迅猛龙 1
88881740 废墟兵械 伶盗龙 1
88881744 废墟兵械的起源地 2
64000016 乱虹之镜-错位伪世 0
64000017 墟梦塌落的轮舞 1
64000002 巨虫的伏击 2
64000030 星月虚璨龙 0
64000022 幽海突戟皇 1
64000004 灾临祸毒虫 1
64000029 九转大肠 2
64000011 炽焰咆哮虎-威吓 0
64000025 仪式魔巫 占卜者 0
64000000 混蛾虫 卡利拉 1
64000026 灼天使 加菲尔 1
64000003 迷夜璃幻蛛 0
64000001 混蛾虫 莎丽雅 1
64000028 烈战的白骑士 2
64000020 雷切剑士 路易斯 2
64000009 摄蜃喵 0
64000023 召引的雷灵 0
64000005 天魔幽女 0
64000050 血咒的魔女 0
64000012 小章鱼 Tarako 1
64000007 幻星彩河之魔女 0
64000010 虚空幻象女巫 1
88881700 蚀暗兽 圣印鹿 1
88881780 星魔·无限 1
88881782 雾都重装兵械 星理捍卫者 1
04878130 清净圣天使 1
"""
sl = f.split("\n")
rl = []
tl = []
for item in sl:
	rl.append(item.split(" "))
for item in rl:
	tl.append(item[0] + " " + item[-1] + " --" + " ".join(item[1:-1]))
for item in tl:
	if item.split(" ")[1] == "0":
		print(item)
for item in tl:
	if item.split(" ")[1] == "1":
		print(item)
for item in tl:
	if item.split(" ")[1] == "2":
		print(item)
