bl = """
#forbidden
30679160 0 --自律部队·支援部队
04576452 0 --反粒子龙
04734591 0 --中子龙
04576495 0 --夸克龙
274513330 0 --德拉科尼亚·潜匿部队
268947311 0 --德拉科尼亚·帝国统帅
27819031 0 --圣光战士
27819019 0 --圣光飞龙-正义吟唱
27819023 0 --圣光女神-阿尔托莉雅
27819035 0 --圣光之勇者 哉佩利敖
27819021 0 --圣光-含光承影
27822031 0 --圣光之源石
27819048 0 --圣光能转换
27819006 0 --圣光天域
27819015 0 --圣光终临
27819017 0 --圣光之矛
27819025 0 --圣水晶-圣光飞龙
27819080 0 --升阶魔法-五王凯旋
27819059 0 --五王的意志
27819078 0 --五王-天启修诺
27819089 0 --五王-启元极
27822036 0 --激流-冰流帝
27822027 0 --通往深渊的激流之路
27822003 0 --激流-后浪奔逐
15000121 0 --林中鹿
27822021 0 --激流海灵龙
27822019 0 --激流飞龙-裂变
27822004 0 --激流-后浪奔逐
95780032 0 --机械维度 矿物开采员
60001202 0 --炙热而冰冷的元素鸡尾酒
60001203 0 --冰冷而风暴的元素鸡尾酒
60001204 0 --风暴而炙热的元素鸡尾酒
60001205 0 --炙热难当的元素鸡尾酒
60001206 0 --冰冷刺骨的元素鸡尾酒
60001207 0 --风暴呼啸的元素鸡尾酒
100666001 0 --废墟之城 克里特科里
100666002 0 --废墟之卫 阿尔赫瓦
100666003 0 --废墟之魔 席尔科斯
100666004 0 --废墟之宝 金汀斯特
100666005 0 --废墟之使 艾米斯利
100666007 0 --废墟之宝 银西尔瓦
100666008 0 --废墟之坛 奥尔特尔
100666009 0 --废墟之礼 培森特尔
100666991 0 --废墟之幻煌
100666992 0 --废墟之异兽
100666993 0 --废墟之永生
100666994 0 --废墟之迷宫
100666995 0 --废墟之兴起
100666996 0 --废墟之报复
100666997 0 --废墟之解放
100666998 0 --废墟之陷落
100666999 0 --废墟之探索
10700003 0 --学园孤岛 若狭悠里
#limit
15003023 1 --虚空孔穴·格利扎
15004110 1 --四次元洞·布鲁顿
15004108 1 --壹世坏交织的细波
07409797 1 --风驰电掣
10703000 1 --战华大宝-界徐盛
10703003 1 --战华阴鬼-神甘宁
10703006 1 --战华大妖-神郭嘉
10703009 1 --战华老宝-谋黄忠
10703012 1 --战华大苟-神荀彧
27822012 1 --激流之界士
27822010 1 --激流之共鸣灵
27822011 1 --激流飞龙之心
27822014 1 --激流之送葬士
27822024 1 --激流海灵龙
27822013 1 --激流之叠光灵
30678600 1 --自律阵地·前线
30655556 1 --星辰的一滴
30655560 1 --孤掷一注的抽卡！YADAZE!
30679610 1 --自律部队·前线部队
30679150 1 --自律部队·联合纵队
30678480 1 --自律部队·火炮部队
30679140 1 --自律部队·第三舰队旗舰
30679120 1 --自律武装·奇袭锚
30679260 1 --自律部队·环星部队
30678470 1 --自律部队·运输部队
30639999 1 --吞食百万的CAPOO
91480010 1 --镚壞-趫棧
91480007 1 --镚壞-圱華
91480008 1 --镚壞-滁○
91580013 1 --镚壞鍺-崆庑
91480002 1 --aoffghvlrbdddfqp3.Dispose()
91480004 1 --class aoffghvlrbdddfqp3 : IDisposeable
91480001 1 --aoffghvlrbdddfqp3()
01543673 1 --原子龙
213452974 1 --德拉科尼亚帝国
10105723 1 --盖亚记忆体-极限
10105720 1 --风车都市-风都
10105408 1 --秀逗缝合灵·冷酷姨妈
10105402 1 --秀逗缝合灵·爱杀老妹
10105403 1 --秀逗缝合灵·肢离破碎女仆团
91460007 1 --设酒杀鸡作食
10105603 1 --流星黑龙·世界熔坏
10105600 1 --真红眼黑龙·烧灭一切
10105636 1 --光道恶魔 欧格里
10105650 1 --命运英雄 惊慌人
10105646 1 --装备了武器手套的超级小蓝
10105649 1 --未来龙皇·洗衣龙女
10105640 1 --破坏剑的转生妖龙
10105645 1 --小蓝骑龙
10105637 1 --正义到临
10105648 1 --洗衣龙龙强强联合
10105656 1 --学习忍术归来的小蓝
10700000 1 --学园孤岛 惠飞须泽胡桃
10700090 1 --新年祈愿 若狭悠里
87498096 1 --屠戮生将军 阿罗娑迦鬼
95780026 1 --机械维度 快鲨艇
95780016 1 --机械维度 尖塔
95780019 1 --机械维度 暴走蟹
95780020 1 --机械维度 炮击兵
95780010 1 --机械维度 爱染明王
27819039 1 --圣光之神女-诺雅
27819044 1 --圣光飞龙的言灵
27819037 1 --圣光追逐者
27819002 1 --圣光飞龙的灵魂
27819043 1 --圣光飞龙的圣灵
27819022 1 --圣光救赎天使
27819012 1 --圣光-守望之碑
27819016 1 --通往天堂的圣光之路
60001000 1 --调酒师 卢娜
10700009 1 --学园孤岛 直树美纪
10700012 1 --学园孤岛 丈枪由纪
#semi-limit
10703015 2 --奇正相生
13131359 2 --奥西里斯的天空龙-神之盾
914206454 2 --真龙斗士 十二宫·狮子
88880100 2 --倪克斯神谕
27822001 2 --激流之先灵
15004459 2 --终诞唤核士·泽内妲
15004466 2 --终诞唤核士·伊芙琳
15004493 2 --始于终世的救赎之核
30679200 2 --自律部队·斩首小组
30679210 2 --自律部队·自行火炮
30678460 2 --自律部队·特殊作业小组
30678450 2 --自律部队·重火力支援组
30678540 2 --自律部队·太空舰队母群
30679000 2 --自律行动·部队调遣
91480009 2 --镚壞-冋歔
91480005 2 --镚壞■笹堺
923154627 2 --通常融合
10105409 2 --缝合灵谜家墓园
10105406 2 --秀逗缝合灵·黑化老爹
66300000 2 --烈火战神 藏身处
91460003 2 --小口
91460005 2 --村舍
95780022 2 --机械维度 异维度神 阎
95780021 2 --机械维度 异维度神 亡
95780024 2 --机械维度 冲锋兵
95780017 2 --机械维度 风巫
95780028 2 --机械维度 刃牙·苍翔
27819036 2 --圣光飞龙的御主
27819004 2 --圣光飞龙的使者
"""
bcs = bl.split("#")
bcs[1] = bcs[1].split("\n")[1:-1]
bcs[2] = bcs[2].split("\n")[1:-1]
bcs[3] = bcs[3].split("\n")[1:-1]
print("#### Forbidden")
for item in bcs[1]:
    print("+ " + item.split("--")[1])
print("#### Limit")
for item in bcs[2]:
    print("+ " + item.split("--")[1])
print("#### Semi-Limit")
for item in bcs[3]:
    print("+ " + item.split("--")[1])
