f = """
48654328 凶导的白死徒 0
42455606 混沌舞者 0
85551811 虚空魔术师之杖 0
57624237 暗冥仲裁者 0
60965917 朋克STD主题演奏 0
88888891 甘狄扒的业 0
98910515 草木皆兵 0
15000481 星拟的终诞 0
28611007 转生炎兽 红莲狐 1
60303246 破坏剑-寻龙之剑 1
88888299 不变的梦想·古渊露龙 1
88888255 妖相百斩 SP洪荒无极 1
88888244 轮回崩坏 梅比乌斯 1
88888888 方界星 寻引之蓝神 1
88888850 无敌巨龙 迦拉克隆 1
88888856 梦魇巨龙 迦拉克隆 1
88888858 讳言巨龙 迦拉克隆 1
15000798 十字刻证兽·菲戾克斯 1
15000601 幻智指令·炎爆 1
15000702 盖理的飞翼·岐居珩 1
15000709 盖理的远客·沙利叶&伊诺兹 1
15000394 替身名-『白蛇』 1
77307169 淘气仙星·布露洛兹 2
"""
sl = f.split("\n")
rl = []
tl = []
for item in sl:
	rl.append(item.split(" "))
for item in rl:
	tl.append(item[0] + " " + item[-1] + " --" + " ".join(item[1:-1]))
for item in tl:
	if item.split(" ")[1] == "0":
		print(item)
for item in tl:
	if item.split(" ")[1] == "1":
		print(item)
for item in tl:
	if item.split(" ")[1] == "2":
		print(item)
